In [40]:
#Segundo dataset de prueba
import pandas as pd

# Leer el CSV usando la ruta completa. Nota: usar r"" para evitar problemas con las barras \
players_salary = pd.read_csv(r"C:\Users\lucas\OneDrive\Escritorio\NBA EXPANSION\players.csv")

# Verificar que se cargó correctamente
print(players_salary.head())

   index        _id         birthDate              birthPlace  career_AST  \
0      0  abdelal01     June 24, 1968            Cairo, Egypt         0.3
1      1  abdulza01     April 7, 1946      Brooklyn, New York         1.2
2      2  abdulka01    April 16, 1947      New York, New York         3.6
3      3  abdulma02     March 9, 1969   Gulfport, Mississippi         3.5
4      4  abdulta01  November 3, 1974  Maisons Alfort, France         1.1

  career_FG% career_FG3% career_FT%  career_G career_PER  ...    draft_pick  \
0       50.2         0.0       70.1       256       13.0  ...  25th overall
1       42.8         NaN       72.8       505       15.1  ...   5th overall
2       55.9         5.6       72.1      1560       24.6  ...   1st overall
3       44.2        35.4       90.5       586       15.4  ...   3rd overall
4       41.7        23.7       70.3       236       11.4  ...  11th overall

  draft_round              draft_team draft_year height  \
0   1st round  Portland Trail Blazers       1990   6-10
1   1st round       Cincinnati Royals       1968    6-9
2   1st round         Milwaukee Bucks       1969    7-2
3   1st round          Denver Nuggets       1990    6-1
4   1st round        Sacramento Kings       1997    6-6

                                highSchool                 name  \
0     Bloomfield in Bloomfield, New Jersey       Alaa Abdelnaby
1           John Jay in Brooklyn, New York      Zaid Abdul-Aziz
2     Power Memorial in New York, New York  Kareem Abdul-Jabbar
3        Gulfport in Gulfport, Mississippi   Mahmoud Abdul-Rauf
4  Lycee Aristide Briand in Evreux, France    Tariq Abdul-Wahad

                   position shoots weight
0             Power Forward  Right  240lb
1  Power Forward and Center  Right  235lb
2                    Center  Right  225lb
3               Point Guard  Right  162lb
4            Shooting Guard  Right  223lb

[5 rows x 25 columns]

In [41]:
len(players_salary)

4685

In [42]:
import pandas as pd

# Leer el CSV de salarios usando ruta completa y raw string
salario = pd.read_csv(r"C:\Users\lucas\OneDrive\Escritorio\NBA EXPANSION\salaries_1985to2018.csv")

# Verificar que se cargó correctamente
print(salario.head())

   index league  player_id  salary   season  season_end  season_start  \
0      0    NBA  abdelal01  395000  1990-91        1991          1990
1      1    NBA  abdelal01  494000  1991-92        1992          1991
2      2    NBA  abdelal01  500000  1992-93        1993          1992
3      3    NBA  abdelal01  805000  1993-94        1994          1993
4      4    NBA  abdelal01  650000  1994-95        1995          1994

                     team
0  Portland Trail Blazers
1  Portland Trail Blazers
2          Boston Celtics
3          Boston Celtics
4        Sacramento Kings

In [43]:
len(salario)

14163

In [44]:
import pandas as pd

# 1️⃣ Calcular el salario promedio por jugador en salario2
salario_mean = salario.groupby('player_id')['salary'].mean().reset_index()

# Renombrar la columna para mayor claridad
salario_mean = salario_mean.rename(columns={'salary': 'salario_mean'})

salario_mean.head()

   player_id  salario_mean
0  abdelal01  5.688000e+05
1  abdulka01  2.140000e+06
2  abdulma02  2.205500e+06
3  abdulta01  3.798280e+06
4  abdursh01  8.715091e+06

In [45]:
len(salario_mean)

2408

In [48]:
# Merge usando player_id y _id
players_salary = players_salary.merge(
    salario_mean,
    left_on='_id',
    right_on='player_id',
    how='left'
)

# Opcional: eliminar la columna 'player_id' si ya no la necesitas
if 'player_id' in players_salary.columns:
    players_salary = players_salary.drop(columns=['player_id'])

# Verificar
players_salary.head()

,index,_id,birthDate,birthPlace,career_AST,career_FG%,career_FG3%,career_FT%,career_G,career_PER,...,draft_round,draft_team,draft_year,height,highSchool,name,position,shoots,weight,salario_mean
0,0,abdelal01,"June 24, 1968","Cairo, Egypt",0.3,50.2,0.0,70.1,256,13.0,...,1st round,Portland Trail Blazers,1990,6-10,"Bloomfield in Bloomfield, New Jersey",Alaa Abdelnaby,Power Forward,Right,240lb,568800.0
1,1,abdulza01,"April 7, 1946","Brooklyn, New York",1.2,42.8,NaN,72.8,505,15.1,...,1st round,Cincinnati Royals,1968,6-9,"John Jay in Brooklyn, New York",Zaid Abdul-Aziz,Power Forward and Center,Right,235lb,NaN
2,2,abdulka01,"April 16, 1947","New York, New York",3.6,55.9,5.6,72.1,1560,24.6,...,1st round,Milwaukee Bucks,1969,7-2,"Power Memorial in New York, New York",Kareem Abdul-Jabbar,Center,Right,225lb,2140000.0
3,3,abdulma02,"March 9, 1969","Gulfport, Mississippi",3.5,44.2,35.4,90.5,586,15.4,...,1st round,Denver Nuggets,1990,6-1,"Gulfport in Gulfport, Mississippi",Mahmoud Abdul-Rauf,Point Guard,Right,162lb,2205500.0
4,4,abdulta01,"November 3, 1974","Maisons Alfort, France",1.1,41.7,23.7,70.3,236,11.4,...,1st round,Sacramento Kings,1997,6-6,"Lycee Aristide Briand in Evreux, France",Tariq Abdul-Wahad,Shooting Guard,Right,223lb,3798280.0

In [49]:
len(players_salary)

4685

In [50]:
# Eliminar filas con NaN en la columna 'salario_mean'
players_salary = players_salary.dropna(subset=['salario_mean'])

# Verificar
print(f"Número de registros después de eliminar NaN: {len(players_salary)}")
players_salary.head()

Número de registros después de eliminar NaN: 2408

,index,_id,birthDate,birthPlace,career_AST,career_FG%,career_FG3%,career_FT%,career_G,career_PER,...,draft_round,draft_team,draft_year,height,highSchool,name,position,shoots,weight,salario_mean
0,0,abdelal01,"June 24, 1968","Cairo, Egypt",0.3,50.2,0.0,70.1,256,13.0,...,1st round,Portland Trail Blazers,1990,6-10,"Bloomfield in Bloomfield, New Jersey",Alaa Abdelnaby,Power Forward,Right,240lb,5.688000e+05
2,2,abdulka01,"April 16, 1947","New York, New York",3.6,55.9,5.6,72.1,1560,24.6,...,1st round,Milwaukee Bucks,1969,7-2,"Power Memorial in New York, New York",Kareem Abdul-Jabbar,Center,Right,225lb,2.140000e+06
3,3,abdulma02,"March 9, 1969","Gulfport, Mississippi",3.5,44.2,35.4,90.5,586,15.4,...,1st round,Denver Nuggets,1990,6-1,"Gulfport in Gulfport, Mississippi",Mahmoud Abdul-Rauf,Point Guard,Right,162lb,2.205500e+06
4,4,abdulta01,"November 3, 1974","Maisons Alfort, France",1.1,41.7,23.7,70.3,236,11.4,...,1st round,Sacramento Kings,1997,6-6,"Lycee Aristide Briand in Evreux, France",Tariq Abdul-Wahad,Shooting Guard,Right,223lb,3.798280e+06
5,5,abdursh01,"December 11, 1976","Marietta, Georgia",2.5,47.2,29.7,81.0,830,19.0,...,1st round,Vancouver Grizzlies,1996,6-9,"Wheeler in Marietta, Georgia",Shareef Abdur-Rahim,Center and Small Forward and Power Forward,Right,225lb,8.715091e+06

In [51]:
len(players_salary)

2408

In [53]:
#Data set madre
import pandas as pd

player_original = pd.read_csv(r"C:\Users\lucas\OneDrive\Escritorio\Csv de nba\player.csv")
player_original.head()

      id            full_name first_name     last_name  is_active
0  76001       Alaa Abdelnaby       Alaa     Abdelnaby          0
1  76002      Zaid Abdul-Aziz       Zaid    Abdul-Aziz          0
2  76003  Kareem Abdul-Jabbar     Kareem  Abdul-Jabbar          0
3     51   Mahmoud Abdul-Rauf    Mahmoud    Abdul-Rauf          0
4   1505    Tariq Abdul-Wahad      Tariq   Abdul-Wahad          0

In [54]:
len(player_original)

4815

In [58]:
import pandas as pd

# Normalizar nombres: quitar espacios, pasar a minúsculas y eliminar tabulaciones
player_original['full_name_clean'] = player_original['full_name'].str.strip().str.lower().str.replace(r'\s+', ' ', regex=True)
players_salary['name_clean'] = players_salary['name'].str.strip().str.lower().str.replace(r'\s+', ' ', regex=True)

# Encontrar coincidencias únicas
coincidencias = set(player_original['full_name_clean']).intersection(set(players_salary['name_clean']))

# Mostrar resultados
print(f"Número de coincidencias únicas entre player_original y players_salary: {len(coincidencias)}")

Número de coincidencias únicas entre player_original y players_salary: 2336

In [59]:
import pandas as pd

# 1️⃣ Normalizar nombres en ambos datasets
player_original['full_name_clean'] = player_original['full_name'].str.strip().str.lower().str.replace(r'\s+', ' ', regex=True)
players_salary['name_clean'] = players_salary['name'].str.strip().str.lower().str.replace(r'\s+', ' ', regex=True)

# 2️⃣ Filtrar solo columnas necesarias de players_salary y eliminar duplicados
salarios = players_salary[['name_clean', 'salario_mean']].drop_duplicates(subset='name_clean')

# 3️⃣ Hacer merge para agregar salario_mean a player_original
player_original = player_original.merge(
    salarios,
    left_on='full_name_clean',
    right_on='name_clean',
    how='left'
)

# 4️⃣ Renombrar la columna agregada y limpiar auxiliares
player_original = player_original.rename(columns={'salario_mean': 'salario_promedio'})
player_original = player_original.drop(columns=['full_name_clean', 'name_clean'])

# 5️⃣ Contar valores no NaN en la nueva columna
num_no_na = player_original['salario_promedio'].notna().sum()
total = len(player_original)
porcentaje_no_na = (num_no_na / total) * 100

print(f"Número de valores no NaN en 'salario_promedio': {num_no_na}")
print(f"Porcentaje de valores no NaN del total: {porcentaje_no_na:.2f}%")

# 6️⃣ Verificar las primeras filas
player_original.head()

Número de valores no NaN en 'salario_promedio': 2367
Porcentaje de valores no NaN del total: 49.16%

,id,full_name,first_name,last_name,is_active,salario_mean_x,salario_mean_y,salario_promedio
0,76001,Alaa Abdelnaby,Alaa,Abdelnaby,0,568800.0,568800.0,568800.0
1,76002,Zaid Abdul-Aziz,Zaid,Abdul-Aziz,0,NaN,NaN,NaN
2,76003,Kareem Abdul-Jabbar,Kareem,Abdul-Jabbar,0,2140000.0,2140000.0,2140000.0
3,51,Mahmoud Abdul-Rauf,Mahmoud,Abdul-Rauf,0,2205500.0,2205500.0,2205500.0
4,1505,Tariq Abdul-Wahad,Tariq,Abdul-Wahad,0,3798280.0,3798280.0,3798280.0

In [60]:
len(player_original)

4815

In [61]:
# Eliminar columnas 'salario_mean_x' y 'salario_mean_y' si existen
cols_a_eliminar = ['salario_mean_x', 'salario_mean_y']
player_original = player_original.drop(columns=[col for col in cols_a_eliminar if col in player_original.columns])

# Verificar
player_original.head()

,id,full_name,first_name,last_name,is_active,salario_promedio
0,76001,Alaa Abdelnaby,Alaa,Abdelnaby,0,568800.0
1,76002,Zaid Abdul-Aziz,Zaid,Abdul-Aziz,0,NaN
2,76003,Kareem Abdul-Jabbar,Kareem,Abdul-Jabbar,0,2140000.0
3,51,Mahmoud Abdul-Rauf,Mahmoud,Abdul-Rauf,0,2205500.0
4,1505,Tariq Abdul-Wahad,Tariq,Abdul-Wahad,0,3798280.0

In [62]:
# Contar valores no NaN
num_no_na = player_original['salario_promedio'].notna().sum()

# Total de registros
total = len(player_original)

# Calcular porcentaje
porcentaje_no_na = (num_no_na / total) * 100

# Mostrar resultados
print(f"Número de valores no NaN en 'salario_promedio': {num_no_na}")
print(f"Porcentaje de valores no NaN del total: {porcentaje_no_na:.2f}%")

Número de valores no NaN en 'salario_promedio': 2367
Porcentaje de valores no NaN del total: 49.16%